#패키지
#프로그램들을 만들때는 파일을 여러가지 만들게 될것이다
#이들중 필요한 파일을 찾기는 쉽지않을것이다 (양이 많아지면)
#이를 해결하기위해 패키지를 쓰게 될것이다

#예를들어 스포츠데이때 축구,농구,배구 등 스포츠 일정을 파일로 만들어 코드를 써 정리한다고하자
#근데 여기서 축구를 찾아야하는데 축구안에도 일정이 여러가지 있을것이다
#이를 어떡해 바로바로 찾을수 있을것인가? 이재 패키지에 대해 알아보자

#폴더를 만든다면은
#축구 안에는 축구플레이어,축구룰,축구팀 등이있을것이고
#배드민턴 안에도 배드민턴플레이어,배드민턴팀,배드민턴 룰,등이 있을것이다

#파이썬도 마찬가지다 프로그램이 커질수록 파일의 수도 많아지기때문에 관련된 모듈을 묶어서 관리를 해야한다
#이처럼 관련있는 모듈을 하나의 디렉터로 묶어 관리하는것을 (패키지) 라고한다
#그냥 프로그램 만들던것처럼 만든것의 양이 만아지면 관리가 힘들기에 정리하는것을 패키지라 생각하면된다
#더 쓸껀없고 원래 배웠던걸 응용하여 패키지를 써보자! (ex:체육대회 관리 프로그램을 만들어보자!)

